## DataFrame vs 2D Arrays

One difference between DataFrames and Numpy Arrays we already talked about:
- Numpy arrays contain entries of same type
- Pandas DataFame can contain columns of different data types

One other key difference between DataFrames and Numpy Arrays is what index information they assume you'll use to query data.

|           |        | Ordered | Named |
| :--:      | :--:   | :--:    | :-:   |
| Array     | Rows   | ✔️       |       |
| Array     | Columns| ✔️       |       |
| DataFrame | Rows   | ✔️       | ✔️     |
| DataFrame | Columns|         | ✔️     |

This reliance on named indices makes it straightforward to work with Pandas data **relationally**, thinking of each row as a specific Record with named Fields. 

Let's see how it works.

### Indexing Rows

Because DataFrame rows are both ordered and named, they can be indexed using either approach, and even both!  Column operations tend to be name-specific:

| Axis        | Ordered Index | Named Index    | Ordered Slice    | Named Slice              |  NamedOrdered Slice     |
| :--:        | :--:          | :--:           | :--:             | :--:                     | :--:                    |
| **Rows**    | `df.iloc[0]`    | `df.loc['John']` | `df.iloc[0:2]`    | `df.loc[['Jim', 'John']]`  |  `df.loc['Jim':'Jenny']`  |
| **Columns** |               |  `df['Q1']`      |                  |  `df[['Q1', 'Q4']]`       |                         |


To reduce total typing, Pandas also has alternate interfaces for the same operations:

| Axis        | Ordered Index | Named Index    | Ordered Slice    | Named Slice              |  NamedOrdered Slice     |
| :--:        | :--:          | :--:           | :--:             | :--:                     | :--:                    |
| **Rows**    |               |                | `df[0:2]`          |                          |  `df['Jim':'Jenny']`      |
| **Columns** |               |  `df.Q1`         |                  |  `df[['Q1', 'Q4']]`        |                         |

**Note**: Notice that square brackets, not round brackets (a.k.a parenthesis) are used after `df.loc` and `df.iloc`.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({ 
    'Name': ['Nick', 'Jenn', 'Joe', "Mo", "Anni"],
    'Age': [31, 55, 25, 29, 38], 
    'Height': [2.9, 1.2, 1.2, 1.8, 1.6],
})
df

   Name  Age  Height
0  Nick   31     2.9
1  Jenn   55     1.2
2   Joe   25     1.2
3    Mo   29     1.8
4  Anni   38     1.6

In [3]:
df.set_index("Name", inplace=True)

In [4]:
df

      Age  Height
Name
Nick   31     2.9
Jenn   55     1.2
Joe    25     1.2
Mo     29     1.8
Anni   38     1.6

## Exercise

1. Load the titanic dataset (from the data folder) as a DataFrame

In [5]:
df = pd.read_csv("./data/titanic.csv")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

2. Select the `age` column.

In [6]:
df["age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

3. Get rows 10-16.

In [7]:
df.iloc[10:16]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True

4. Select the first 5 rows of the "sex" column

In [8]:
df["sex"].iloc[:5]

0      male
1    female
2    female
3    female
4      male
Name: sex, dtype: object

5. Select the `fare` column.

In [9]:
df["fare"]

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: fare, Length: 891, dtype: float64

6. Select the `survived` and `age` columns.

In [10]:
df[["survived", "age"]]

     survived   age
0           0  22.0
1           1  38.0
2           1  26.0
3           1  35.0
4           0  35.0
..        ...   ...
886         0  27.0
887         1  19.0
888         0   NaN
889         1  26.0
890         0  32.0

[891 rows x 2 columns]

7. Select the last 3 rows of the `alive` column.

In [11]:
df["alive"].iloc[-3:]

888     no
889    yes
890     no
Name: alive, dtype: object

## Summarizing / Aggregating Data in DataFrames

Pandas also supplies many different aggregation functions as methods:

```python
df.mean()
df['Column'].mean()
```
<br>

**Examples**:  mean, median, max, min, count, value_counts, unique

## Exercise

In [12]:
import pandas as pd

In [13]:
url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv'
df = pd.read_csv(url)
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

1. What is the mean ticket fare that the passengers paid on the titanic?

In [14]:
df["fare"].mean()

32.2042079685746

2. How many passengers does this dataset contain?

In [15]:
df.shape[0]

891

3. How many men and women are in this dataset? (`value_counts()`)

In [16]:
df["sex"].value_counts()

male      577
female    314
Name: sex, dtype: int64

4. What proportion of the passengers were alone on the titanic?

In [17]:
df['alone'].mean()

0.6026936026936027

5. How many different classes were on the titanic?

In [18]:
df["class"].unique().shape

(3,)

6. How many passengers of each sex are sitting in each class?

In [19]:
df[["class", "sex"]].value_counts()

class   sex
Third   male      347
        female    144
First   male      122
Second  male      108
First   female     94
Second  female     76
dtype: int64

## Querying Data via Logical Indexing

To get rows based on their value, Pandas supports logical indexing - similar to Numpy.  For example, to get all the rows of a dataframe that are positive for `Column1`:

```python
positive_rows = df['Column1'] > 0
df[positive_rows]
```
<br>

Often, this is done in a single line:

```python
df[df['Column1'] > 0]
```

## Exercise

Let's go back to the Titanic dataset and do some data querying.

1. Did the oldest passenger on the Titanic survive?

In [20]:
dd_oldest = df[df["age"] == df["age"].max()]
dd_oldest["survived"]

630    1
Name: survived, dtype: int64

2. Where did the youngest passenger on the Titanic embark from?

In [21]:
dd_youngest = df[df["age"] == df["age"].min()]
dd_youngest["embark_town"]

803    Cherbourg
Name: embark_town, dtype: object

3. How many passengers on the Titanic embarked from Cherbourg?

In [22]:
df[df["embark_town"] == "Cherbourg"].shape[0]

168

4. What is mean ticket fare for the 1st class?

In [23]:
dd_first_class = df[df["class"] == "First"]
dd_first_class["fare"].mean()

84.15468749999992

... What about the 2nd class?

In [24]:
dd_first_class = df[df["class"] == "Second"]
dd_first_class["fare"].mean()

20.66218315217391

... What about the 3rd class?

In [25]:
dd_first_class = df[df["class"] == "Third"]
dd_first_class["fare"].mean()

13.675550101832997

5. What was the average age of female passengers?

In [26]:
dd_female = df[df["sex"] == "female"]
dd_female["age"].mean()

27.915708812260537

6. What percentage of the female passengers survived?

In [27]:
dd_female["survived"].mean() * 100

74.20382165605095

## Transforming Data

Any transformation function can be performed on each element of a column, or even all columns of a DataFrame.  Here are several options for this approach:

Numpy-like Operator syntax with Broadcasting:
```python
df['Column1'] * 100
```
<br>

Functions-style syntax:
```python
np.sqrt(df['Column1'])
```
<br>

Object's methods:
```python
df['Column1'].str.upper()
```

## Exercise

1. Make a new column called `OnTitanic`, with all of the values set to `True`.

In [28]:
df["OnTitanic"] = True

In [29]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,OnTitanic
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,True
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,True

2. Make a new column called `isAdult`, with `True` values if they were 18 or older and `False` if not.

In [30]:
df["isAdult"] = False
df.loc[df["age"] >= 18, "isAdult"] = True

In [31]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,OnTitanic,isAdult
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,True,True
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True,True
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,True,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,True,True

3. Get everyone's age if they were still alive today (hint: Titanic sunk in 1912)

In [32]:
df["AgeToday"] = df["age"] + (2022 - 1912)

In [33]:
df["AgeToday"]

0      132.0
1      148.0
2      136.0
3      145.0
4      145.0
       ...
886    137.0
887    129.0
888      NaN
889    136.0
890    142.0
Name: AgeToday, Length: 891, dtype: float64

4. Make a column called `not_survived`, the opposite of the `survived` column.

In [34]:
df["not_survived"] = 1 - df["survived"]

In [35]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,OnTitanic,isAdult,AgeToday,not_survived
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,True,True,132.0,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,True,True,148.0,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,True,True,136.0,0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,True,True,145.0,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,True,True,145.0,1

## Further reading

Pandas has great documentation, tutorials, and examples. You can get started [here](https://pandas.pydata.org/docs/getting_started/)